{"meta":{"title":"Yujie's Blog","subtitle":"","description":"欢迎和我一起进步！分享生活！分享热爱","author":"Chen Yujie","url":"http://example.com","root":"/"},"pages":[],"posts":[{"title":"Hexo+Github搭建个人技术博客（MAC操作版）","slug":"搭建个人技术博客","date":"2023-07-21T12:53:54.655Z","updated":"2023-07-21T14:48:53.963Z","comments":true,"path":"2023/07/21/搭建个人技术博客/","link":"","permalink":"http://example.com/2023/07/21/%E6%90%AD%E5%BB%BA%E4%B8%AA%E4%BA%BA%E6%8A%80%E6%9C%AF%E5%8D%9A%E5%AE%A2/","excerpt":"第一次尝试搭建个人技术博客，记录踩坑实践","text":"第一次尝试搭建个人技术博客，记录踩坑实践 一、MAC本机 【1】打开终端terminal，安装homebrew PS: 如果没有报错，可以直接安装；否则建议卸载重装 卸载命令： 1$ /bin/bash -c &quot;$(curl -fsSL https://gitee.com/ineo6/homebrew-install/raw/master/uninstall.sh)&quot; 安装命令： 1$ /bin/bash -c &quot;$(curl -fsSL https://gitee.com/ineo6/homebrew-install/raw/master/install.sh)&quot; 如果遇到“homebrew-core”相关的错误，或者运行太慢卡住，直接运行如下代码： 123$ cd /usr/local/Homebrew/Library/Taps/homebrew/$ rm -rf homebrew-core$ git clone https://github.com/Homebrew/homebrew-core.git 测试是否安装成功 1brew -v 【2】安装node.js 安装命令： 1234brew install nodenvnodenv install stablenodenv rehashbrew install node 测试是否安装成功 12node -vnpm -v 配置环境变量 打开终端，输入命令： 1nano ~/.bash_profile 在文件中输入如下命令，按control + O 保存退出 1export PATH=&quot;/usr/local/bin:$PATH&quot; 重启终端。运行以下指令来检查你的环境变量是否设置成功： 1echo $PATH 【3】安装hexo 本地新建一个文件夹（如： &#x2F;Users&#x2F;chenyujie&#x2F;Desktop&#x2F;yujie_blog)，博客相关文件将储存在此文件夹下。 安装hexo 1npm install hexo-cli -g 进入到这个文件夹里面 1cd /Users/chenyujie/Desktop/yujie_blog 新建一个blog文件夹，执行命令初始化hexo配置（此处的blog是你要建立的文件夹名称） 1hexo init blog 进入这个文件夹下面，执行如下命令，开启Hexo本地服务器（本地查看效果）： 12hexo generatehexo server 这时候出现如下字样，即成功，可进入http://0.0.0.0:4000/查看效果： 1INFO Hexo is running at http://0.0.0.0:4000/. Press Ctrl+C to stop. 这时候，本地博客就成功搭建了！如果想要别人能访问到，可以将博客部署到Github Pages上。 二、Github操作 【1】首先你要拥有一个github账号，注册完成后，你将拥有一个你的用户名（如：abc） 【2】新建仓库 仓库名称：**你的用户名.github.io** (如：**abc**.github.io) 【abc需要与用户名保持一致】 选择默认的Public 初始化README文件【打个勾就行】 点击创建即可完成此步骤 【3】配置SSH密钥 在MAC本地操作，回退到yujie_blog目录，然后运行ssh开头的那行命令生成密钥，中间经历两次回车即可 123cd /Users/chenyujie/Desktop/yujie_blogssh-keygen -t rsa -C &quot;your email@example.com&quot; // 引号里面填写你的邮箱地址 完成后会有一个ssh-rsa开头的密钥，结尾是你前面配置的邮箱，全部复制粘贴，如果没有复制上，可以选择执行下面的命令，然后再复制 1cat ~/.ssh/id_rsa.pub 切换到Github，打开自己右上角页面的头像处，点击下拉框中的Settings，再点击 SSH and GPG Keys，选择 New SSH key，粘贴密钥，Title随意填写，Key填写刚才粘贴的内容。 此时可以回退到MAC本地，测试一下如下命令（无需修改，直接复制粘贴测试），之后输入yes， 返回 You’ve succcessfully authenticated..表示设置正确 1ssh -T git@github.com 配置个人信息： 用户名就是前面那哥abc , 邮箱可以看下github注册时自己填的哪个邮箱，尽量保持一致 12git config --global user.name &quot;此处填你的用户名&quot; git config --global user.email &quot;此处填你的邮箱&quot; 此时，SSH Key已经配置成功，本机已成功连接到 Github 【4】打开github设置的仓库 你的用户名.github.io （如：abc.github.io）, 点击Clone or download 按钮，选择 Use SSH，复制 【5】任意打开一个编辑器，打开blog文件夹下的_config.yml文件，拉到最后，按照如下修改 123456# Deployment## Docs: https://hexo.io/docs/one-command-deploymentdeploy: type: &#x27;git&#x27; repository: 刚刚复制的【4】中的ssh地址 branch: main【和github默认分支保持一致】 【6】MAC本地执行，在blog文件夹路径下，执行 123hexo g hexo d// 或者直接执行 hexo g -d 如果此时报错，执行如下命令： 1npm install hexo-deployer-git --save 然后再执行如下命令，博客就会部署到Github上了 1hexo g -d 这时候可以访问 https:&#x2F;&#x2F;你的用户名.github.io（如：https://abc.github.io）如果此时没有显示，建议多刷新几次，或者等待会儿 三、发文章 【1】新建一个文章， 可以在blogs&#x2F;source&#x2F;_posts下手动生成 文章标题.md 文件，也可以直接执行如下命令生成 1hexo n &quot;文章标题&quot; 【2】用编辑器编写文章，我用的Typora 1234567891011121314151617181920---layout: 页面布局（配合主题文档使用）title: 文章名称date: 文章日期comments: 文章是否开启评论photos: 文章封面图（仅部分主题支持）tags: - 文章标签一 - 文章标签二categories: 文章分类description: 文章描述，即要在首页显示的摘要（仅部分主题支持）---这里是摘要&lt;!-- more --&gt;这里是正文注意：description 和 &lt;!-- more --&gt; 方式显示摘要二选一即可，部分主题不支持description，每个配置英文冒号后面要空一格，不同主题配置有所差异，具体要参考主题文档 [&lt;!-- more --&gt;在正文前面配置这个，可以让网页不用展示全文] 【3】如果有图片文件，可以在blogs&#x2F;source文件夹下面新建images文件夹，之后md中的文件路径均为“&#x2F;images&#x2F;你的图片.jpg ‘图片名’” 【4】上传文件 1hexo g -d 四、给个人博客换个你喜欢的主题 【1】点击此处进入 Hexo 官网的主题专栏 【2】目标是把主题克隆过来，首先随便点个你喜欢的主题（如：hexo-theme-hiero），然后找到页面上的 Theme By xxx, 之后点击xxx，页面跳转对应的GitHub地址，然后复制网址 【3】进入到blog文件下的themes目录，执行如下代码，然后相应主题的目录就会在themes文件夹下出现 1git clone 此处填写你刚才复制的网址 【4】打开 blog 文件夹下的配置文件 _config.yml ，找到关键字 theme，修改参数为：theme：你选的主题名（如hexo-theme-hiero） 【5】返回blog目录，执行如下命令即可发现，博客主题已经更换 12hexo g hexo s 【6】执行如下命令，清楚缓存，并部署到GitHub 12hexo clean hexo g -d 这里面可以配置 _config.yml文件，修改title相关的信息，与主题相关的配置文件blogs&#x2F;_config.yml 五、为博客添加搜索功能 local_search: 【1】在blog文件夹下执行如下命令 1npm install hexo-generator-json-content --save 【2】仍需修改主题的_config.yml文件 （不过我的主题下默认开启了，不是如下内容） 123# 本地搜索local_search: enable: true 我配置的主题显示如下： 1234search: insight: true # you need to install `hexo-generator-json-content` before using Insight Search swiftype: # enter swiftype install key here baidu: false # you need to disable other search engines to use Baidu search, options: true, false Algolia 搜索: 【1】获取 Algolia 账号 注册 Algolia，进入官网地址 注册，也可以直接用Github授权登录。 【2】新建 Index（Create index） 【3】安装hexo-algoliasearch插件（推荐） 1npm install hexo-algoliasearch --save 【4】打开Algolia网站，点击Settings，点击Team and Access下面的API Keys。然后，在最外层文件夹下（如yujie_blog），修改配置文件_config.yml 123456789101112131415algolia: appId: &quot;your applicationID&quot; apiKey: &quot;your Search-Only API Key&quot; adminApiKey: &quot;your Admin API Key&quot; chunkSize: 5000 indexName: &quot;your indexName&quot; fields: - content:strip:truncate,0,500 - excerpt:strip - gallery - permalink - photos - slug - tags - title 其中【applicationID】填入 Applicaiton ID，【apiKey】填入Search-Only API Key ，【Admin API Key】填入 Admin API Key ，【indexName】填入前面创建的索引名称。 【5】执行如下命令 1hexo algolia 可以去 Algolia 网站上查看，索引已经上传成功了。 【6】在主题配置文件_config.yml中修改以下内容： 12345678algolia_search: enable: true hits: per_page: 10 labels: input_placeholder: Search for Posts hits_empty: &quot;我们没有找到任何搜索结果: $&#123;query&#125;&quot; hits_stats: &quot;找到$&#123;hits&#125;条结果（用时$&#123;time&#125; ms）&quot; 【7】重新编译运行，即可看到效果 12hexo cl &amp;&amp; hexo generatehexo s","categories":[{"name":"计算机","slug":"计算机","permalink":"http://example.com/categories/%E8%AE%A1%E7%AE%97%E6%9C%BA/"}],"tags":[{"name":"开发","slug":"开发","permalink":"http://example.com/tags/%E5%BC%80%E5%8F%91/"}]},{"title":"Day1018-The Economist｜MAGA Republicans plan：make Donald Trump’s second term count","slug":"Day1018-The Economist","date":"2023-07-15T02:34:24.675Z","updated":"2023-07-21T14:47:08.804Z","comments":true,"path":"2023/07/15/Day1018-The Economist/","link":"","permalink":"http://example.com/2023/07/15/Day1018-The%20Economist/","excerpt":"文章来源：《经济学人》Jul 15th 2023 期 Leaders 栏目 How MAGA Republicans plan to make Donald Trump’s second term countMAGA共和党人计划让唐纳德·特朗普的第二个任期有所成就 Preparing for government They think they know how to banish the chaos and frustrations of his first four years1“MAGA Republicans” 指的是“Make America Great Again”（让美国再次伟大）共和党人，通常用来形容支持前总统唐纳德·特朗普的共和党人。 他们认为自己知道如何消除他的第一任期中的混乱和挫败感 image: federico yankelevich Jul 13th 2023","text":"文章来源：《经济学人》Jul 15th 2023 期 Leaders 栏目 How MAGA Republicans plan to make Donald Trump’s second term countMAGA共和党人计划让唐纳德·特朗普的第二个任期有所成就 Preparing for government They think they know how to banish the chaos and frustrations of his first four years1“MAGA Republicans” 指的是“Make America Great Again”（让美国再次伟大）共和党人，通常用来形容支持前总统唐纳德·特朗普的共和党人。 他们认为自己知道如何消除他的第一任期中的混乱和挫败感 image: federico yankelevich Jul 13th 2023 The overwhelming memory of Donald Trump’s time in office is of chaos and resentment. It was summed up by the shameful end to his presidency, when his whipped-up supporters sacked the Capitol in a bid to keep him in power. Mr Trump has since lurched from an ignominious post-electoral impeachment to two criminal indictments, with perhaps more in the offing. The former president seems obsessed with relitigating his election loss in 2020: “I am your justice,” he thundered to a crowd of supporters this year. “I am your retribution.” 唐纳德·特朗普执政时期最令人难忘的记忆是混乱和怨恨。他任期结束时可耻的表现体现了这一点，当时他为了让自己继续掌权，去煽动支持者攻占国会大厦。从那以后，特朗普先生经历了一次可耻的选举后弹劾以及两项刑事起诉，可能还有更多的起诉在即。这位前总统似乎痴迷于于重新审议他在2020年的选举失败：“我会为你们伸张正义，”他今年向一群支持者咆哮道。“我会为你们寻求报复和惩罚。” Mr Trump is likely to win the Republican presidential nomination for 2024. You might think victory in the general election would foreshadow even more chaos—this time without the grown-ups who, it turns out, at first reined in their impulsive new boss. In fact, a professional corps of America First populists are dedicating themselves to ensuring that Trump Two will be disciplined and focused on getting things done. They are preparing the way and you should not dismiss their efforts. 特朗普先生很可能会赢得2024年共和党总统候选人提名。你可能认为，如果他在大选中获胜，这会预示着更多的混乱，这一次没有成熟的人一开始就控制他那冲动的新老板。实际上，一支由“美国优先”民粹主义者组成的专业队伍正在致力于确保“特朗普第二任期”将会是有纪律性的，并专注于把事情做好。他们正在为此做准备，你不应该忽视他们的努力。 In contrast to the slapdash insurgency that captured the White House in 2016, the veterans of Mr Trump’s first term have been years at work, as our Briefing this week lays out. Even at this early stage, the details are something to behold. Thousand-page policy documents set out ideas that were once outlandish in Republican circles but have now become orthodox: finishing the border wall, raising tariffs on allies and competitors alike, making unfunded tax cuts permanent and ending automatic citizenship for anyone born in the United States. They evince scepticism for nato and pledge to “end the war on fossil fuels”, by nixing policies designed to limit climate change. 123【1】slapdash 草率的“unfunded tax cuts” 指的是减税措施没有相应的财政支出来抵消税收减少所带来的财政损失。 与2016年占领白宫的匆忙起义形成鲜明对比的是，特朗普先生第一任期的老将们已经工作了多年，正如本周的Briefing中所述的那样。即使在这个早期阶段，这些细节也值得关注。成千上万页的政策文件列出了曾经在共和党圈子里不可思议的想法，但这些想法现在已经成为正统：完成边境墙、提高盟友和竞争对手的关税、使未经资助的减税措施永久化，并取消在美国出生的任何人自动获得公民身份的政策。他们对北约持怀疑态度，并承诺通过废除旨在限制气候变化的政策，“结束对化石燃料的战争”。 Alongside these proposals is something that aims to revolutionise the structure of government itself. maga Republicans believe that they will be able to enact their programme only if they first defang the deep state by making tens of thousands of top civil servants sackable. Around 50,000 officials would be newly subject to being fired at will, under a proposed scheme known as Schedule f. 除了这些提议之外，还有一些旨在彻底改变政府结构的东西。支持“让美国再次伟大”的共和党人相信，他们只有先通过解雇数万名高级公务员来削弱“阻碍”势力，才能实施自己的计划。根据一项“Schedule F” 方案，大约有50,000名官员可以被随意解雇。 At the same time, to fill the thousands of political appointments at the top of the American civil service, the America Firsters are creating a “conservative LinkedIn” of candidates whose personal loyalty to Mr Trump is beyond question. Merely expressing qualms about the storming of the Capitol on January 6th 2021 is grounds for disqualification. None of this is a shadowy conspiracy: it is being planned in the open. 与此同时，为了填补美国公务员系统高层的成千上万个政治任命职位，美国优先派正在创建一个“保守派 LinkedIn”平台，该平台上的候选人对特朗普先生的个人忠诚是毋庸置疑的。仅仅对2021年1月6日国会大厦冲击事件表示疑虑就足以被取消资格。这一切都不是一个阴谋：它是在公开计划中进行的。 America Firsters will argue that civil-service reform promises to enhance democracy by preventing the unelected bureaucracy from stymying the programme of an elected president. Although checks and balances are an important part of America’s constitutional design, the civil service is not one of the three branches of government it enshrines. 美国优先派将会辩称，公务员制度改革承诺通过“防止未经选举的官僚机构阻碍当选总统的计划”来增强民主。虽然权力制衡是美国宪法设计的重要组成部分，但公务员系统并不是其中规定的三个政府分支之一。 That argument does not wash. One objection is practical. The draining of brains from government would come just as the expansion of the American state across the economy makes a competent bureaucracy more important than ever. Running a modern nation state requires expertise in administration, economics, foreign affairs and science. If officials cannot challenge political appointees’ madder proposals for fear of being fired, policy will rot from the inside. 这种论点并不可行。一个反对意见是实际性。在美国政府扩张经济的同时，政府内部人才的流失将使得一支胜任的官僚队伍变得比以往任何时候都更为重要。管理现代国家需要在政治、经济、外交和科学方面具备专业知识。如果官员们因为害怕被解雇而不敢挑战政治任命者的疯狂提议，政策就会从内部腐败。 A second objection is political. A future Democratic president endowed with imperial powers and unchecked by reality is not something Republicans should wish for. One reason for the professionalisation of the bureaucracy in the 19th century was to provide the ship of state with enough ballast to keep sailing from one administration to the next. 123强调了政府内部专业化和稳定性的重要性，以确保政府能够在不同政治派别之间保持连续性和稳定性，而不会受到政治任命和权力滥用的干扰。航海中的实践 -&gt; 船只需要足够的压舱石或者重物来保持平衡和稳定 第二个反对意见是政治性。共和党人不应该希望未来的民主党总统拥有帝国主义权力并且不受现实的制约。19世纪官僚机构专业化的一个原因是为了为国家的稳定性提供足够的支持和保障，以便从一届政府顺利过渡到下一届政府。 A third objection is that these changes would give an overmighty president direct control of the Department of Justice. By being able to sack all of its purported dissenters, the administration would obliterate the norm of legal independence. If so, Trumpian resentment would be channelled into concrete vengeance. That prospect should concern all Americans. 第三个反对意见是这些变化将使得总统过于强大，能够直接控制司法部。通过能够解雇所有所谓的异见人士，政府将抹杀法律独立的规范。如果这样做，特朗普的怨恨将转化为具体的报复行动。这种前景应该关系到所有美国人。 Having encountered resistance from his previous attorneys-general, the prime criterion for Mr Trump’s next one would be a suppleness of spine: a willingness to quash investigations into the president and his allies and to authorise them against his long list of real and perceived political enemies. Although Mr Trump would have little practical reason to continue to foment distrust in the electoral system—since the constitution precludes a third term—the need to be vindicated about his supposedly stolen election in 2020 may lead him to do so, all the same. 由于之前的几位总检察长对他的要求表示了反对，特朗普先生下一位总检察长的首要标准是“愿意妥协”：愿意压制针对总统及其盟友的调查，并授权对他那长长的真实和虚构的政治敌人进行调查。尽管特朗普没有什么实际的理由继续煽动对选举制度的不信任——因为宪法禁止第三次连任——但他对自己在2020年被偷走的选举结果的平反需求可能会促使他这么做。 If the Republicans win both houses of Congress, as is possible, nobody in the executive or the legislature will be in a position to stop Mr Trump. After all, most of those in charge will already have publicly attested to the legitimacy of storming the Capitol. The federal courts will become one of the few remaining redoubts of independence and expertise in the American system. It is hard to see how they will not also come under sustained attack. 如果共和党在国会两院都获胜，这是有可能的，那么行政和立法部门中没有人能够阻止特朗普先生。毕竟，大多数负责人已经公开证实了冲击国会大厦的合法性。联邦法院将成为美国体系中仅存的独立和专业性的要塞之一。很难想象他们不会受到持续的攻击。 If these carefully laid plans were enacted, America would follow Hungary and Poland down the path of illiberal democracy. True, America has more guardrails against backsliding—including centuries of democratic history and a more raucous and more decentralised media. However, these guardrails are weaker than in the past. Moreover, many Americans would be left worse off by these plans. Trust in institutions and the rule of the law would suffer, leaving the country yet more divided. 如果这些精心制定的计划得以实施，美国将走上匈牙利和波兰走过的非自由民主之路。当然，美国有更多的防范机制来防止倒退，包括数个世纪的民主历史和更为喧闹和更为分散的媒体。然而，这些防护机制比以往更脆弱。此外，许多美国人将因这些计划而处境更加困难。信任机构和法治将受到损害，从而使美国更加分裂。 Donaldus imperatorSome people will try to take comfort from the idea that Mr Trump will not win the primary, or that he will lose the general election. Perhaps his nominees will not be confirmed, or the emperor of entropy will sabotage his own supporters’ designs. That is unforgivably complacent. 有些人会试图从这种想法中得到安慰，即特朗普先生不会赢得初选，或者他将在大选中失利。也许他的提名不会得到确认，或者“特朗普”会破坏他支持者的计划。这种自满态度是不可原谅的【这是对那些低估特朗普先生的力量和影响力的人的批评和警告，这种态度是危险的，可能会导致特朗普先生的成功】。 Mr Trump is favourite to win the nomination in a country where general elections are determined by a few tens of thousands of votes. In victory, a team of practised demolition experts would prime their explosive ideas. The deconstruction of the administrative state could begin. The vain and tyrannical whims of an emperor-president would emerge from the rubble. ■ 在一个大选由几万张选票决定的国家，特朗普有望赢得提名。如果他获胜，一支经验丰富的拆除专家团队将会推行他们具有破坏性的思想。行政国家的解构将会开始。一个自负和专制的皇帝总统的异想天开将从废墟中崛起。","categories":[{"name":"经济学人","slug":"经济学人","permalink":"http://example.com/categories/%E7%BB%8F%E6%B5%8E%E5%AD%A6%E4%BA%BA/"}],"tags":[{"name":"经济学人","slug":"经济学人","permalink":"http://example.com/tags/%E7%BB%8F%E6%B5%8E%E5%AD%A6%E4%BA%BA/"}]},{"title":"Day1017-The Economist｜Size wars：Is big business really getting too big?","slug":"Day1017-The Economist","date":"2023-07-03T01:45:06.394Z","updated":"2023-07-21T14:47:48.179Z","comments":true,"path":"2023/07/03/Day1017-The Economist/","link":"","permalink":"http://example.com/2023/07/03/Day1017-The%20Economist/","excerpt":"文章来源：《经济学人》Jul 15th 2023 期 Business 栏目 Is big business really getting too big?大企业真的会越变越大吗？ Size wars规模战 In a few sectors, corporate concentration is a problem. In most, it needn’t be 在一些行业，企业“高集中度”是个问题。但在大多数行业中，情况并非如此 image: vincent kilbride","text":"文章来源：《经济学人》Jul 15th 2023 期 Business 栏目 Is big business really getting too big?大企业真的会越变越大吗？ Size wars规模战 In a few sectors, corporate concentration is a problem. In most, it needn’t be 在一些行业，企业“高集中度”是个问题。但在大多数行业中，情况并非如此 image: vincent kilbride Governments are at war with big business. In June Joe Biden, America’s president, spoke for many politicians the world over when he blamed it for greed-fuelled price rises, sluggish wage growth, forgone innovation and fragile supply chains. His trustbusters at the Federal Trade Commission (ftc) have been going after large deals merely because they are large—or at least that is how it feels. Courtroom defeats do not dampen the agency’s zeal. The latest came on July 11th, when a judge rejected its request to block Microsoft’s $69bn acquisition of Activision Blizzard, a developer of video games. The ftc is expected to appeal against the ruling. The eu’s competition authorities are making noises about breaking up Google. Last year Britain’s Competition and Markets Authority (cma) derailed the $40bn acquisition by Nvidia, a semiconductor giant, of Arm, a chip-designer. 1【1】making noises about sth 放出有关某事的风声 政府正与大企业“交战”。今年6月，美国总统乔•拜登代表世界各地的许多政客发声，他将贪婪导致的物价上涨、工资增长缓慢、放弃创新以及脆弱的供应链归咎于大企业。他在联邦贸易委员会的反垄断调查官员一直在追查大型交易，仅仅是因为它们规模大——至少他们感觉是这样的。法庭上的失败并没有削弱该机构的热情。最近的一次“失败”是在7月11日，法官驳回了阻止微软以690亿美元收购视频游戏开发商动视暴雪的请求。预计联邦贸易委员会将对这一裁决提起上诉。欧盟竞争主管部门正闹着要分拆谷歌。去年，英国竞争与市场管理局(cma)阻止了半导体巨头英伟达以400亿美元收购芯片设计公司Arm的交易。 Trustbusters invoke three justifications for their renewed vigour: greater market concentration, reduced churn among the world’s biggest firms and rising corporate profits. On the surface all three point to rising corporate power. Look closely, though, and the trends may be the result of benign factors such as technological progress and globalisation. In some local markets, greater concentration may, paradoxically, have led to more competition, not less. And the covid-19 pandemic may have planted the seeds of a further competitive revival. Some big firms, it is true, have been collecting rents, including in big sectors such as health care. But trustbusters’ strategy—to reflexively question any deal involving a big firm—is wrongheaded. 123&quot;Market concentration&quot; 指的是市场上某一行业或领域中，少数几家大型企业占据了主导地位，形成了垄断或卡特尔。这种情况通常会导致缺乏竞争，从而影响市场效率和消费者福利。全球最大公司之间的流动减少：这意味着大型公司之间的并购、收购和分拆等交易的数量正在减少。这可能会导致市场上较少的竞争，从而影响市场效率和消费者福利。 反垄断调查人员对他们“重新振作”给出了三个理由：“市场集中度”更高，世界上最大的公司之间的流动减少，以及公司利润的增长。从表面上看，这三点都指向企业实力的上升。然而，仔细观察，这些趋势可能是技术进步和全球化等良性因素的结果。矛盾的是，在一些本地市场，集中度的提高可能导致竞争加剧，而不是减少。新冠疫情可能已经为进一步的竞争复苏播下了种子。确实，一些大公司一直在收取租金，包括医疗保健等大行业。但是反垄断调查人员的策略（即条件反射性地质疑任何涉及大公司的交易）是错误的。 That concentration has been rising is not in question. Across America’s economy it is higher today than at any point in at least the past century (see chart 1). Out of some 900 sectors in America tracked by The Economist, the number where the four biggest firms have a market share above two-thirds has grown from 65 in 1997 to 97 by 2017. In Europe, where the data are less comprehensive, market power has been increasing for at least 20 years. Using data on western Europe’s largest economies—Britain, Germany, France, Italy and Spain—Gabor Koltay, Szabolcs Lorincz and Tommaso Valletti, three economists, find that the market share of the four largest firms grew in 73% of some 700-odd industries from 1998 to 2019. The average increase was about seven percentage points. The proportion of firms with a share above 50% increased from 16% of industries to 27% by 1998 to 2019. Britain and France saw the biggest jumps. 市场集中度的上升是毫无疑问的。纵观美国经济，市场集中度比过去一个世纪的任何时候都要高（见图表1）。根据《经济学人》追踪的美国约900个行业中，其最大的四家公司的市场份额超过三分之二的行业数量从1997年的65家增长到2017年的97家。在数据不太全面的欧洲，市场实力至少20年来一直在增强。三位经济学家Gabor Koltay、Szabolcs Lorincz和Tommaso Valletti利用西欧最大经济体（英国、德国、法国、意大利和西班牙）的数据发现，1998年至2019年间，约700多个行业中有73%的四大公司的市场份额增长了。平均增长约为7个百分点。市场份额超过50%的公司比例从1998年的16%增加到2019年的27%。英国和法国的增幅最大。 At the same time, incumbent firms look more entrenched. In Britain, the average number of firms that stick in the top ten of their industries by market share three years later was five before the financial crisis. It is now closer to eight. Thomas Philippon of New York University’s Stern School of Business finds a similar reduction in churn among top American firms. 与此同时，现有公司的地位似乎更加稳固。在英国，在金融危机爆发之前，平均有五家公司在三年之后的市场份额上仍然位居行业前十。现在这个数字接近八家。纽约大学斯特恩商学院的Thomas Philippon发现，美国顶尖公司之间的流动性也减少了。 Most telling, firms are raking in higher profits. The Economist has come up with a crude estimate of “excess” profits for the world’s 3,000 largest listed companies by market value (excluding financial firms). Using reported figures from Bloomberg we calculate a firm’s hurdle rate of return on invested capital above 10% (excluding goodwill and treating research and development as an asset with a ten-year lifespan). This is the rate of return one might expect in a competitive market. In the past year excess profits reached $4trn, or nearly 4% of global gdp (see chart 2). They are highly concentrated in the West, especially America. American firms collect 41% of the total, with European ones taking 21%. The energy, technology and, in America, health-care industries stand out as excess-profit pools relative to their size. 最有说服力的是，公司正在获得更高的利润。《经济学人》对全球市值最大的3,000家上市公司（不包括金融公司）的“超额”利润进行了粗略估算。使用彭博社的报告数据，我们计算出一家公司的投资资本回报率应该在10%以上(（不包括商誉，并将研发视为具有十年寿命的资产）。这是在竞争市场中可能期望的回报率。在过去一年中，超额利润达到4万亿美元，约占全球GDP的4%（见图表2）。它们高度集中在西方，特别是美国。美国公司占总数的41%，欧洲公司占21%。能源、技术和在美国的医疗保健行业相对于其规模而言是超额利润池。 All this looks troubling. And in certain sectors, it is. Four decades ago more than eight in ten hospitals were non-profits with a single location. Now more than six in ten are owned by sprawling for-profit hospital chains or academic networks such as Steward Health Care or Indiana University Health. At first this was a perfectly healthy process of big and efficient chains expanding across America. Two decades—and nearly 2,000 hospital mergers—later, things look ropey. An analysis from 2019 by Martin Gaynor of Carnegie Mellon University and colleagues suggests that such mergers have tended to raise prices without improving quality. 这一切看起来都很麻烦。在某些领域，确实如此。40年前，超过80%的医院都是单一地点的非营利性医院。现在，超过六成的医院为大型盈利性连锁医院或学术网络所有，如Steward Health Care或Indiana University Health。起初，这是一个非常有益的过程，大型和高效的连锁店在美国扩张。二十年后，近2000家医院合并，情况看起来不太乐观。卡内基梅隆大学的Martin Gaynor及其同事从2019年开始的一项分析表明，这些并购往往会提高价格，但并未改善医疗服务质量。 Still, high concentration, low churn and rich profits need not necessarily make consumers worse off. That concentration has been rising for 100 years, during which life has improved for virtually everyone, is the first clue that it may be the result of benign forces. Increases in industry concentration in America over the past century are correlated with greater technological intensity, higher fixed costs and higher output growth, according to Yueran Ma of the University of Chicago Booth School of Business and colleagues. None of these seems particularly nefarious. 1【1】nefarious 恶毒的 尽管存在高度集中、低流动性和丰厚的利润，但这并不一定会使消费者受到损害。这种集中已经持续了100年，而在这期间，几乎每个人的生活都得到了改善，这是可能是良性力量的第一个迹象。根据芝加哥大学布斯商学院的Yueran Ma和同事的研究，美国过去一个世纪的行业集中度上升与更高的技术密集度、更高的固定成本和更高的产出增长有关。这些因素似乎都不是特别险恶的。 That concentration has also risen in Europe, where competition authorities have not been as sleepy as in America, likewise suggests that powerful structural forces are at play. John Van Reenen of the London School of Economics fingers technology and globalisation. The internet has reduced the cost of shopping around, even as software and other technology allow the best firms to scale up their operations around the world. Figures collected by McKinsey, a consultancy, show that the return on invested capital for a firm in the 75th percentile by this measure is 20 percentage points higher than for a median firm. “There are just huge economies of scale with software,” says Sterling Auty of MoffettNathanson, a research firm. 在欧洲，集中度也在上升，而那里的竞争当局并没有像美国那样“沉睡”，这同样表明强大的结构性力量正在发挥作用。伦敦经济学院的John Van Reenen指出，技术和全球化是原因。互联网降低了比价成本，同时软件和其他技术使最好的公司能够在全球范围内扩大业务规模。咨询公司麦肯锡收集的数据显示，按照这个指标，在处于75百分位数的公司的投资回报率比中位数公司高20个百分点。“软件存在巨大的规模经济效应，” 研究公司MoffettNathanson的Sterling Auty说道。 Local anti-heroes Moreover, higher concentration at the country level may increase competition locally. Service industries in particular, which make up about half the 900-odd sectors in America’s census, are better examined at the local level. Fiona Scott Morton, a former deputy assistant attorney-general now at Yale School of Management, uses the example of coffee shops. With just one café in each neighbourhood, the national market would be hyperfragmented. But every consumer would face a local monopoly. “If I’m looking for a coffee, I’m not going to drive three hours,” she says. 此外，国家层面上的高度集中度可能会增加本地的竞争。特别是服务业，美国人口普查中约900个行业的一半左右都是服务业，它更适合在地方层面上进行研究。现任耶鲁大学管理学院教授、前美国司法部副助理总检察长Fiona Scott Morton以咖啡店为例。如果每个社区只有一个咖啡店，那么全国市场将会非常分散。但每个消费者都将面临本地垄断。“如果我想找一家咖啡店，我不会开车三个小时去找，”她说道。 Academics debate what exactly has happened to concentration in local markets. What seems increasingly clear is that the best firms have expanded into more and more of them. Walmarts, with their “everyday low prices”, cater to shoppers across America, thanks to the retail behemoth’s unrivalled logistics operation. Cheesecake Factory uses a laboratory in California to taste-test dishes that it quickly rolls out to its 200 or so locations around America. A recent paper titled “The Industrial Revolution in Services’‘, by Esteban Rossi-Hansberg at the University of Chicago and his co-author, shows that the geographic expansion of big firms increases competition for local incumbents, whose local market share falls. 学者们对于本地市场的集中度到底发生了什么进行了激烈的辩论。但越来越明晰的是最好的公司已经扩展到了越来越多的本地市场。沃尔玛以其“每日低价”服务于美国各地的购物者，这得益于这家零售巨头无与伦比的物流运营能力。芝士蛋糕工厂使用加利福尼亚州的一个实验室来测试菜肴的味道，然后迅速推向其在美国约200个地点的门店。芝加哥大学的Esteban Rossi-Hansberg及其共同作者最近发表的一篇名为“服务业的工业革命”的论文表明，大公司的地理扩张增加了对本地现有企业的竞争，其本地市场份额下降。 As for low churn, it is not so bad if the incumbents keep innovating—which is what many are doing. Despite central banks pushing interest rates up at the fastest pace in decades in an attempt to quash inflation, American private investment in the first quarter of 2023 was 17.2% of gdp, similar to pre-pandemic highs. Many corporate behemoths are ploughing billions into innovation, including in areas that most worry trustbusters, such as technology. American tech’s big five—Alphabet, Amazon, Apple, Meta and Microsoft—collectively invested around $200bn in r&amp;d last year, about a quarter of America’s total in 2021. Microsoft and Alphabet are at the forefront of the ai race. 至于低流动性，如果现有企业不断创新，情况就不会那么糟糕——“不断创新”正是许多企业正在做的事情。尽管中央银行试图通过迅速提高利率来抑制通胀，但美国私人投资在2023年第一季度占GDP的17.2%，与疫情前的高点相似。许多企业巨头正在向创新领域投入数十亿美元，包括最令反垄断监管机构担忧的技术领域。美国科技界的五大巨头——Alphabet、亚马逊、苹果、Meta和微软——去年共投资约2000亿美元进行研发，约占美国2021年总投资的四分之一。微软和Alphabet处于人工智能竞赛的前沿。 Profits have, it is true, been higher in America since the financial crisis of 2007-09 than in previous decades, especially if you consider free cashflows, which accounts for the changing way companies depreciate assets (see chart 3). But they look somewhat less unusual if you adjust for lower tax rates and firms’ larger global footprint. And they may have peaked: analysts estimate that earnings for the s&amp;p 500 index of American blue chips dipped in the three months to June, year on year, for the third quarter in a row. 确实，自2007-09年金融危机以来，美国的利润率比之前几十年都要高，特别是如果考虑自由现金流，这是由于公司折旧资产方式的变化所导致的（见图3）。但如果考虑税率降低和公司更大的全球业务范围，它们看起来就不那么异常了。而且它们可能已经达到了峰值：分析师估计，美国蓝筹股标普500指数在截至6月的三个月中，连续第三个季度同比下降。 Most heartening, far from being subdued, dynamism may be on the rise. John Haltiwanger of the University of Maryland notes that business formation, which had been “quite anaemic” since the mid-2010s, has surged since the pandemic (see chart 4). In the past few years many more new firms have been created than old ones have been shut down. Whether these startups will dislodge incumbents is still unclear. But venture-capital investment suggests investors see scope for healthy returns. Although it is half what it was at its frothy peak of over $130bn in the fourth quarter of 2021, that has only brought it back to the levels of 2019 and 2020. 1“Business formation” 指的是新企业的创立。这些新企业可能是由个人、团队或公司创立的，旨在为市场提供新的产品或服务。企业创立通常是经济活力和创新的重要指标之一。 最令人振奋的是，经济活力可能正在上升，而非被抑制。马里兰大学的John Haltiwanger指出，自2010年代中期以来一直“相当萎靡不振”的“企业创立数量”自疫情爆发以来激增（见图4）。在过去几年中，新成立公司的数量比关闭的老公司多得多。这些初创企业是否会取代现有企业仍不清楚。但风险投资投资表明，投资者看到了健康回报的空间。虽然与2021年第四季度超过1300亿美元的泡沫高峰相比，风险投资只有一半，但这只是将其带回到2019年和2020年的水平。 One hypothesis is that the remote-friendliness of the post-covid economy reduces startup costs. Young firms no longer need to rent a big office. They can hire from a less local talent pool. By our rough count, around 125 of the Census Bureau’s 900-odd industries benefit from rising e-commerce or can provide their services remotely. Consumers’ growing comfort with such options could inspire more new businesses to set up shop. Mr Haltiwanger already observes a small shift in the size distribution of firms towards smaller fry. 一种假设是，后疫情时代经济的远程友好性降低了初创企业的成本。年轻的企业不再需要租用大型办公室，他们可以从更广泛的人才库中招聘员工。据我们粗略统计，美国人口普查局的约900个行业中，约有125个行业受益于电子商务的兴起或可以远程提供其服务。消费者对这些选项的不断接受可能会激发更多的新企业开张。Haltiwanger先生已经观察到，企业规模分布已经出现了向较小企业的微小转移。 Concentration may also be levelling off as a result of subdued dealmaking, especially in tech. The big five tech firms’ share of all acquisitions by listed firms in America has fallen from nearly 1% in the 2010s to less than 0.5% since the start of Mr Biden’s tenure. Some of the slowdown in mergers and acquisitions (m&amp;a) is caused by the rising cost of capital and risk of recession. But renewed antitrust zeal must be playing a role. On June 27th American authorities updated their merger guidelines for the first time in 45 years, requiring firms to report far more details on deals worth over $110m, half the average deal size in 2022. 由于交易活动的减弱，尤其是在科技领域，集中度也可能出现平稳。美国上市公司进行的所有收购交易中，五大科技公司所占比例已从2010年代的近1%下降到拜登政府上任以来的不到0.5%。一些并购交易放缓是由于资本成本上升和经济衰退风险增加所致。但新的反垄断热情肯定也在发挥作用。6月27日，美国当局首次在45年内更新了其并购指导方针，要求企业对超过1.1亿美元（2022年平均交易规模的一半）的交易报告更多细节。 The biggest transactions are almost sure to be subject to a deep probe, which can add months to a filing process that now takes weeks. Regulators everywhere are throwing “sand in the gears of the m&amp;a machine”, sighs a lawyer. “The ftc has stopped being discerning,” says another. Britain’s cma “has probably overreached”, echoes a British one. 123Throwing ‘sand in the gears of the M&amp;A machine’ 指的是监管机构在并购审查中增加了更多的限制和要求，从而使得并购交易更加困难和耗时。这个说法常用于形容监管机构对并购交易的干预和限制。“Stopped being discerning” 指的是监管机构在并购审查中对不同交易的区别和细节不再做出精细的判断，而是采取了一刀切的方式。这个说法常用于形容监管机构在并购审查中的不公正或不合理的做法。 最大的交易几乎肯定会受到深入调查，这可能会使申报过程延长数月，而现在这个过程只需要几周时间。到处都有监管机构在“干预并购”，一位律师叹息道。另一位律师表示，“联邦贸易委员会已经停止了鉴别（一刀切）”。一位英国律师也表示，“英国竞争与市场管理局可能已经过度（干预）了”。 Such overzealous trustbusting carries its own risks. It may distract attention from more immediate threats to economic dynamism from bureaucratic restraints on land use or occupational licensing. Acquisitions can be useful for preserving the value of startups when subdued markets make it hard for founders to raise capital. And some big deals may benefit consumers, as when a biotech startup joins forces with established drugmakers to test and distribute a new therapy. Competition authorities were probably asleep for too long. Now they may be getting up too quickly. ■ 这种过度热衷于打破垄断的做法也有其自身的风险。它可能会转移人们对经济活力面临的更直接威胁的注意力，使人们不再关注官僚机构对土地使用或职业许可的限制。在市场低迷时期，收购对于保护初创企业的价值可能非常有用，因为创始人很难筹集资本。一些大型交易可能会让消费者受益，比如一家生物技术初创公司与老牌制药公司联手测试和销售一种新疗法。竞争监管机构可能“沉睡”得太久了。现在他们可能“行动”得太快了。■","categories":[{"name":"经济学人","slug":"经济学人","permalink":"http://example.com/categories/%E7%BB%8F%E6%B5%8E%E5%AD%A6%E4%BA%BA/"}],"tags":[{"name":"经济学人","slug":"经济学人","permalink":"http://example.com/tags/%E7%BB%8F%E6%B5%8E%E5%AD%A6%E4%BA%BA/"}]},{"title":"Day1015-The Economist｜Bartleby：How white-collar warriors gear up for the day","slug":"Day1015-The Economist","date":"2023-07-03T01:44:58.636Z","updated":"2023-07-21T14:48:04.772Z","comments":true,"path":"2023/07/03/Day1015-The Economist/","link":"","permalink":"http://example.com/2023/07/03/Day1015-The%20Economist/","excerpt":"文章来源：《经济学人》Jul 8th 2023 期 Business 栏目 How white-collar warriors gear up for the day白领战士如何准备一天的工作 Bartleby巴托比 Achilles goes to the office阿喀琉斯去了办公室 image: paul blow Jul 6th 2023","text":"文章来源：《经济学人》Jul 8th 2023 期 Business 栏目 How white-collar warriors gear up for the day白领战士如何准备一天的工作 Bartleby巴托比 Achilles goes to the office阿喀琉斯去了办公室 image: paul blow Jul 6th 2023 “The iliad” is a story of glory and gods, revenge and mercy, death and immortality. Squint hard enough and it is also a workplace saga. The epic kicks off with a big row between a pair of co-workers called Agamemnon and Achilles. The gods are the senior leadership team, descending from on high to cause complete chaos. For most of the book Achilles, a prototype of the talented jerk, is on strike. This is a big problem for the Greek management team, who have lost their best performer. A delegation from hr fails to win Achilles over. Eventually, however, he returns to the office, and all is well (Trojans may disagree). 《伊利亚特》是一个关于荣耀与神、复仇与仁慈、死亡与永生的故事。仔细看，这也是一个职场传奇。史诗从一对称为阿伽门农和阿喀琉斯的同事之间的大争吵开始。众神是高级领导团队，从高处降临，造成彻底的混乱。在书的大部分时间里，阿喀琉斯（有才华的混蛋原型）都在罢工。这对希腊的管理团队来说是个大问题，他们失去了最好的执行者。人力资源部的代表团没能说服阿喀琉斯。然而，最终，他回到办公室，一切都很好(特洛伊人可能不同意)。 The parallels between the 21st-century workplace and “The Iliad” are admittedly inexact. There are fewer swords and spears glinting in the rosy-fingered dawn today; there is a bit less brain matter on the floor. But to see the modern connections to Homer’s epic, look at Achilles’s preparations to go back to work. 诚然，将21世纪的职场与《伊利亚特》相提并论是不准确的。今天，在玫瑰色手指的黎明里闪闪发光的剑和矛少了；地板上的脑液少了一点。但要了解现代与荷马史诗的联系，看看阿喀琉斯为重返工作所做的准备。 “Now I shall arm myself for war,” he says in Book 19. The arming of Achilles is the forebear of gearing-up scenes ever since, from Chaucer to Rambo. But it also has echoes of current daily rituals. Achilles puts on bronze greaves and shining breastplates; employees choose clothes that they don’t wear at the weekend. Achilles puts on his golden-plumed helmet; commuters don their Bose headphones. The Homeric hero takes up a shield forged by Hephaestus, the god of fire. The office worker stuffs a laptop and charger into a rucksack. “现在我要武装自己准备战争”他在第19卷中说。阿喀琉斯的武装是自从那时起的先驱，从乔叟到兰博都有其影子。但它也有当前日常仪式的影子。阿喀琉斯穿上青铜护膝和闪亮的胸甲；员工会选择周末不穿的衣服。阿喀琉斯戴上金色羽毛的头盔；通勤者戴着Bose耳机。荷马英雄拿起火神赫菲斯托斯锻造的盾牌。上班族把笔记本电脑和充电器塞进背包。 Most of this white-collar arming takes place inside the home, but not all. It also happens en route to the battlefield, as compacts emerge and make-up is applied on the Tube. Sometimes the transformation takes place in the office itself. Trainers are swapped for heels. Lycra-clad colleagues disappear from view and emerge in something less off-putting. 1【1】off-putting 令人讨厌的 大多数白领“武装”都在家中进行，但并不是全部。在去“战场”的途中也会发生，比如在地铁上拿出粉饼化妆。有时，这种转变也会在办公室内发生。运动鞋换成了高跟鞋。穿着莱卡的同事从视线中消失，换上不那么令人讨厌的衣服。 Battle may be close but it does not arrive instantly, whether you are the king of the Myrmidons or Barry from accounts. Both have thresholds to cross before the real action begins. In Homer’s epic, Achilles has been sitting out the war in an encampment; his appearance on the seashore is when the Greeks learn that he is going to rejoin the fray. There is a feast before the fighting starts (Achilles refuses to eat; perhaps there wasn’t a vegan option). Once armed, he gets on his chariot and goes to the front “resplendent as the sun-god Hyperion”. 战斗可能即将到来，但它并不会立即到来，无论你是密耳弥多涅斯人的国王还是财务部的巴里。在真正的行动开始之前，两者都需要跨越一些门槛。在荷马史诗中，阿喀琉斯一直在营地中拒绝出战；当他出现在海滩上时，希腊人就知道他将重新加入战斗。战斗开始前有一场盛宴（阿喀琉斯拒绝吃饭；也许这里没有素食可选）。武装后，他上了战车，前往前线，“如太阳神海泼里恩一样耀眼”。 For remote workers the gap between their personal and professional lives may be narrow: the walk from the fridge to the living room (and back again, and back again). That is a problem. Entering the workplace means putting on a different persona as well as different clothes—you, but with added self-control. The transition is easier to make when there are clear boundaries separating home and work. 对于远程工作者来说，个人生活和职场生活之间的差距可能很小：从冰箱走到客厅（然后又走回去，再回来）。这是个问题。进入工作场所意味着不仅要换上不同的衣服，还要变换不同的“角色”——是你，但要加上更多的自制力。当家庭和工作之间有明确的界限时，这种转变更容易实现。 Office-goers have many more thresholds to cross. They emerge onto the street in the morning and make the journey towards their desks. They enter a café for their morning coffee; carrying a cup and walking briskly is the simplest way to let fellow citizens know you are gainfully employed. At some point they will have their first encounter with a fellow employee. If they are very unfortunate, this meeting will occur at the start of the commute and involve excruciating small talk on public transport for 40 minutes. Normally, it will just mean that the office is close. 上班族需要跨越许多门槛。他们早晨走出家门，开始前往办公桌的旅程。他们进入咖啡馆买早晨的咖啡；拿着杯子快步走是让其他市民知道你是有工作的最简单的方法。在某个时刻，他们将与同事进行第一次会面。如果他们非常不幸，这次会面将发生在通勤的开始，并包括40分钟的煎熬闲聊。正常情况下，与同事会面意味着办公室就在附近。 Workers must then make their entry into the office itself. There are security guards to greet, passes to swipe and lift buttons to press. Visitors to the office will participate in an extra arming scene at this point, in which they sign their names illegibly into a register and are given a lanyard. Hyperion, indeed. 接着，工人们必须进入办公室。他们需要与保安打招呼、刷通行证、按电梯按钮。此时，来访者将参与额外的武装场景，他们需要在登记簿上写下难以辨认的名字，并被给予一个挂绳。确实，就像海泼里恩一样。 The moment for action is now imminent. Outside the walls of Troy, Achilles springs forward like “a fierce lion”; a cycle of carnage begins that will end with the death of Hector. The white-collar worker must make final preparations for the day ahead, too. The rucksack comes off, and the computer switches on. The salaried hero springs forward, jaws foaming, to take a last bite of croissant; crumbs fleck the keyboard and the carpet. The password is entered, the loading wheel spins, the heart rate remains exactly the same. It’s time. 行动的时刻现在即将来临。在特洛伊城墙外，阿喀琉斯像“一只凶猛的狮子”一样向前冲；一轮屠杀开始了，最终以赫克托之死结束。白领工人也必须为即将到来的一天做最后的准备。卸下背包，打开电脑。拿着薪水的英雄张开嘴巴，像最后一口羊角面包一样猛扑上去，面包屑撒满了键盘和地毯。输入密码，等待加载，心率保持不变。是时候了。 Homer would never have made a name for himself with an office-based epic: death and glory guarantee a more dramatic narrative than email and meetings. But when you put on your work clothes, change into your professional self and pitilessly strike your first key, you are more than just a foot-soldier. You are a tiny Achilles. ■ 荷马永远不会因为办公室史诗而出名：死亡和荣耀比电子邮件和会议更具戏剧性。但当你穿上工作服，变成专业的自己，并毫不留情地敲下第一个键时，你不仅仅是一个步兵。你是一个小小的阿喀琉斯。■ 【里面的动作描述很生动形象，值得学习】","categories":[{"name":"经济学人","slug":"经济学人","permalink":"http://example.com/categories/%E7%BB%8F%E6%B5%8E%E5%AD%A6%E4%BA%BA/"}],"tags":[{"name":"经济学人","slug":"经济学人","permalink":"http://example.com/tags/%E7%BB%8F%E6%B5%8E%E5%AD%A6%E4%BA%BA/"}]}],"categories":[{"name":"计算机","slug":"计算机","permalink":"http://example.com/categories/%E8%AE%A1%E7%AE%97%E6%9C%BA/"},{"name":"经济学人","slug":"经济学人","permalink":"http://example.com/categories/%E7%BB%8F%E6%B5%8E%E5%AD%A6%E4%BA%BA/"}],"tags":[{"name":"开发","slug":"开发","permalink":"http://example.com/tags/%E5%BC%80%E5%8F%91/"},{"name":"经济学人","slug":"经济学人","permalink":"http://example.com/tags/%E7%BB%8F%E6%B5%8E%E5%AD%A6%E4%BA%BA/"}]}